SameDirectionFlow/0/region2/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region2";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{
    inlet2
    {
        type            fixedValue;
        value           uniform 0.00375;
    }

    outlet2
    {
        type            zeroGradient;
    }

    region2_to_pipeWall
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }

    outerWall
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
}
// ************************************************************************* //
